/************************************************************************************************************************************************************
*																																							*
*																Marriage Dialogue																			*
*			These are specific to the spouse and are nearly all needed.... Just fill it in.																	*
*																																							*
*************************************************************************************************************************************************************/
{    
	"Rainy_Day_0": "I really like this new farm life. The fresh air, the view of your farm. It's nice.",
    "Rainy_Day_1": "I was gonna make pancakes but I think I burnt the pan. Nevermind.$b#$b#",
    "Rainy_Day_2": "You look nice today! Since when did I get so lucky?$b#$b#",
    "Rainy_Day_3": "Y'know, when it rains worms come up to the surface of the soil. Makes them easier prey. Aren't I a mine of knowlege?",
    "Rainy_Day_4": "I think we have a leak in the roof. I'll need to get a bucket later.",
    "patio_Tom": "I've always wanted a pet. Of course, Alex's dog is good company, but a pet of my own. Preferably not a dog, though.",
    "Rainy_Day_Steve": "Is it true I look similar to Alex? But I have better hair, though.$u#$b#",
    "Rainy_Night_0": "It's getting cold. I'll make sure the fire is on.",
    "Rainy_Night_1": "Ugh I don't like spiders, or any other insects. They're attracted to my hair. Oh hey! So are you!$a#$b#.",
    "Rainy_Night_2": "I was reading the other day, a comic book. I'm getting into those now. You should try them too.",
    "Rainy_Night_3": "Ever heard of Marvel comics? They're fantastic. I recommend you read one before bed.",
    "Rainy_Night_4": "I'm pretty tired after a day's work, but I'm sure it's nothing compared to what you do.",
    "Rainy_Night_5": "Did you go mining today? Did you get hurt?$a#$b# I swear I'll decapitate those little-#$b#Sorry. I'm just glad you're safe.$b#$b#",
    "Rainy_Night_Steve": "I hope it doesn't rain tomorrow. I'm counting on some warm sunshine for us both.",
    "Indoor_Day_0": "I care about you a lot. It's slightly worrying how much I do.",
    "Indoor_Day_1": "Honey, I made you breakfast! Well, er, I did. I think your pet ate it though.$u#$b#",
    "Indoor_Day_2": "I heard Haley has a crush on Alex. They've been freinds for ages. Apparently she liked me, but I wasn't having that.",
    "Indoor_Day_3": "Y'know, I had a small crush on you when we first met.",
    "Indoor_Day_4": "Has Gus finally spoke to Emily yet? I mean, Emily is single. He needs to be confident and do it.$h#$b#",
    "Indoor_Day_Steve": "I miss you when you leave. Don't stay out too long, kay?",
    "Indoor_Night_0": "I've got pretty damn lucky. I'm so glad I moved here.",
    "Indoor_Night_1": "I wish Dustin was here.",
    "Indoor_Night_2": "Hon, you liked tired. Did everything go okay today?$s#$b#",
    "Indoor_Night_3": "I love you, you know that right?$b#$b#",
    "Indoor_Night_4": "Should I try to get buff like Alex? Nah. He should be trying to get hair as good as mine.$h#$b#",
    "Indoor_Night_Steve": "I used to have a diary, and hid it under my pillow. Who knows where it is now.",
    "Outdoor_0": "Our place is pretty nice. The farm looks so good.",
    "Outdoor_1": "Is your pet's food bowl full? I would fill it but I don't have a watering can.",
    "Outdoor_2": "Do we have a rooster on our farm? I wake up early every morning from hearing one. It's not annoying.",
    "Outdoor_3": "You wanna know something? I think the doctor secretly liked you. Good job I got here first.$b#$b#",
    "Outdoor_4": "Should we play football? Keep in mind I might beat you.$h#$b#",
    "Outdoor_Steve": "Tell me all about how you made such a beautiful farm.$4",
    "funLeave_Steve": "I'm gonna head to the beach today. It'll lighten my hair. I'll see you later, love.",
    "funReturn_Steve": "Well Alex showed up and we played football together. How was your day?",
    "OneKid_1": "I hope our kid gets my good hair!",
    "TwoKids_0": "Hopefully one of our kids has hair as incredible as mine. And your good looks.",
    "TwoKids_2": "I still can't beleive it. Look out our family!",
    "TwoKids_3": "I want to give our children a good childhood. No monsters. And no spiky bats.",
    "Good_1": "Great times are ahead of us!",
    "Good_2": "You're a good person, I'm glad I know you.$h#$b#",
    "Good_3": "I can't cook but you can and you're amazing at it!",
    "Good_4": "I love living here. It just so nice and peaceful.",
    "Good_5": "I think we should head to the beach, the water's warm.$h#$b#",
    "Good_6": "All's going really good here.",
    "Good_7": "You know I wouldn't give you up for anything.$b#$b#",
    "Good_8": "I'm so thankful to have met you.#$b#And one day, maybe we'll have lots of grandchildren running around our farm.$b#$b#",
    "Good_9": "I tried to write you a love poem, and I'm definitely not a poet, but here it is...#$b#Roses are red, violets are blue, I would be lost without you...#$b#Then I was going to write glue, because it's the only thing I could find to rhyme.#$b#But that wouldn't make sense, would it? Glue... glue.$h#$b#",
    "Neutral_0": "I enjoy being outside. It's a good way of relaxing.",
    "Neutral_1": "I once used to be a really bad person, times have changed luckily.",
    "Neutral_2": "Things are okay around here. But... I don't know. Nevermind.$u#$b#",
    "Neutral_3": "Is everything okay with you right now? Things haven't been as...$s#$b#",
    "Neutral_4": "Cooking isn't my favourite thing to do. Well, you can cook at least.$s#$b#",
    "Neutral_5": "I think I might skip town to see the newest Marvel movie. Are you a fan?",
    "Neutral_6": "I just don't get how Alex can work out so frequently.",
    "Neutral_7": "I'm kinda hungry, You?",
    "Neutral_8": "I think Iron Man is my favourite hero.$h#$b#",
    "Neutral_9": "Should we buy some Marvel films?",
    "Bad_0": "Look, I need confirmation. Are you having second thoughts about... us?$s#$b#",
    "Bad_1": "Maybe I should have just gone for Haley when I had the chance... she liked me for a while. Now it's all about Alex.$s#$b#",
    "Bad_2": "Did I do something wrong? Am I not worth it anymore?$s#$b#",
    "Bad_3": "Why don't we talk as much anymore?$s#$b#",
    "Bad_4": "This is getting tiring,@.$s#$b#",
    "Bad_5": "If you want to back out of this relationship... please just tell me.$s#$b#",
    "Bad_6": "You helped me into my best me. But... you've been so distant. I feel like I'm slipping.$s#$b#",
    "Bad_7": "Hi... I guess.$s#$b#",
    "Bad_8": "I don't really want to talk to you.$s#$b#",
    "Bad_9": "Whatever.$s#$b#",
    "spring_1": "My new year's resolution is to care less about my hair. I want to help you out more.",
    "spring_8": "Things are slowly warming up now. Even though it's spring. Summer is soon!",
    "spring_23": "I won't be dancing tomorrow, but I wouldn't mind if you danced with someone else. As long as they aren't Alex. Or Harvey. Or Sebastian. Or Hailey. Or Shane. Or Clint. Or Linus. Or...",
    "summer_1": "The heat of summer is upon us!#$b#Drink plenty of water and don't overwork yourself.",
    "summer_8": "If you like, we can have a nice beach date together.#$b#I think you'd enjoy a refreshing dip in the ocean to cool off!$1",
    "summer_15": "The heat can really get to you sometimes. I hope Alex can give us a discount for icecream!$0",
    "fall_1": "Isn't fall just so calming? Orange and red and yellow leaves everywhere!$1",
    "fall_8": "I'll collect extra wood to store for winter. Nothing better than a warm fire on a cold day.$4",
    "fall_15": "What are you going to put on display tomorrow? I hope you outshine Pierre.#$e#He wins every year! I hope you beat him!$1",
    "fall_26": "You won't beleive how excited I am to stuff myself with food. It's the best part of the festival!$1",
    "winter_1": "Winter's here already. Last time I checked it was summer!$u",
    "winter_7": "Are you going to fish tomorrow, doll? Go make Willie proud for me.#$e#I don't mind if you don't win, as long as you don't let anyone else win.",
    "winter_28": "Thank you so much for staying by my side all year. I'm so lucky to have someone like you in my life.$4#$b#To celebrate the New Year! [348]",
    "spouseRoom_Steve": "I hope the house doesn't look too messy! I forgot to put away my hair gel.",

}